"""
1.什么是框架
    框架是为了为解决一类问题而开发的程序，框架两个字可以分开理解，框：表示指定解决问题的边界，明确要解决的问题；
    架：表达的是能够提供一定的支撑性和可扩展性；从而实现解决这类问题达到快速开发的目的。

2.为什么要实现框架
    1.现成开源第三方框架的局限性,现成的第三方框架是为了尽可能满足大部分需求,不能做到面面俱到
    以及第三方框架的调试相对复杂
    2.解决特定的工作需求
    工作中会有很多特殊的需求,会使用某种套路去实现这些需求,那么为了提高效率可以专门把
    这种套路封装成框架
    3.提高自己的技术能力


4.爬虫的流程
    1.构建请求信息(url、method、headers、params、data)
    2.发起HTTP/HTTPS请求，获取HTTP/HTTPS响应
    3.解析响应，分析响应数据的数据结构或者页面结构
        提取数据
        提取请求的地址
    4.对数据进行存储/对新的请求地址重复前面的步骤

5.模块之间的逻辑关系
    构造spider中start_urls中的请求
    传递给调取器进行保存，之后从中取出
    取出的request对象交给下载的进行下载，返回response
    response交给爬虫模块进行解析，提取结果
    如果结果是request对象，重新交给调度器，如果结果是item对象，交给管道处理
"""